Revit 2027 API
LinkLoadResult.GetParentModelName Method
 Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetParentModelName()
Public Function GetParentModelName As ModelPath
public:
ModelPath^ GetParentModelName()
member GetParentModelName : unit -> ModelPath
Return Value
ModelPath
Remarks
 This function is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace